Can't project Analytical Model to Analytical Projection Surface
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StructAnalyticalErrorProjection { get; }
  Visual Basic
Public Shared ReadOnly Property StructAnalyticalErrorProjection As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StructAnalyticalErrorProjection {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AnalyticalModelFailures Class
  Autodesk.Revit.DB Namespace